Revit 2024 API
BuiltInFailures.FabricFailures.MajorLapSpliceFailure Property
 The lap splice in the major direction is greater than the half of the overall length.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId MajorLapSpliceFailure { get; }
Visual Basic
Public Shared ReadOnly Property MajorLapSpliceFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ MajorLapSpliceFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FabricFailures Class
Autodesk.Revit.DB Namespace